const D00100AccordionContent = () => (
  <>
    <ol className="accordionContent">
      <li>提醒您，轉帳前請再次確認交易對象，切勿聽從陌生人指示執行交易，避免詐騙陷阱。如有疑問，請洽本行客服中心專線：0800-261732、(02)8073-1166查詢，亦可撥打165反詐騙諮詢專線查證，以保障您的帳戶安全。</li>
      <li>轉帳交易限額與其他自動化設備(ATM、網路ATM、電話語音銀行及行動銀行)合併計算。</li>
      <li>
        臨櫃開立帳戶，轉帳限額如下：
        <ul>
          <li style={{ listStyle: 'none'}}>(1)自行轉帳限額：每帳戶單筆轉帳限額500萬元，每帳戶當日累積轉限額500萬元。</li>
          <li>(2)跨行轉帳限額：每帳戶單筆轉帳限額200萬元，每帳戶當日累積轉限額300萬元。</li>
          <li>(3)非約定轉帳限額：每帳戶單筆最高5萬、當日(日曆日)累計最高10萬、當月累計最高20萬。</li>
        </ul>
      </li>
      <li>
        數位存款帳戶，非約定轉帳限額如下：
        <ul>
          <li>(1)三類：每帳戶單筆最高1萬、當日(日曆日)累計最高3萬、當月累計最高5萬。</li>
          <li>(2)一類及二類：每帳戶單筆最高5萬、當日(日曆日)累計最高10萬、當月累計最高20萬。</li>
        </ul>
      </li>
      <li>若遇電腦系統故障時或其他不可抗力事故，故未能於指定日期進行處理時，申請人同意順延至障礙事由排除後本行始進行處理。</li>
      <li>預約交易之轉出帳戶，需於您所設定之交易生效日前一營業日，存入足夠的金額。</li>
      <li>申請人若欲取消預約轉帳交易，最遲應於預約轉帳交易日之前一日辦理。</li>
      <li>手機號碼轉帳視同非約定轉帳，限額亦同。倘您未選擇銀行代號，且收款人亦無預設收款帳戶，將導致該筆轉帳交易失敗。</li>
      <li>若您已於本行設定活期存款餘額不足支付時，其不足額即自動以定期存款質借方式支應者，此情況下本行將收取質借利息。如欲取消此功能，請您至本行任一分行申請。</li>
    </ol>
  </>
);

export default D00100AccordionContent;
