export const FuncID = {
  A00300: 'A003', // 登入頁面 - 登入首頁
  A00400: 'A004', // 登入頁面 - 開通APP
  A00600: 'A006', // 登入頁面 - 定期更新個資 (六個月)
  A00700: 'A007', // 登入頁面 - 定期更新密碼 (一年)
  A00800: 'A008', // 訪客註冊
  B00100: 'B001', // 首頁 - 首頁 (彩卡/優惠Banner)
  B00200: 'B002', // share? TODO: 確認功能中文名稱
  B00300: 'B003', // 快捷列_通知 - 訊息總覽
  B00500: 'B005', // 首頁 - 優惠
  B00600: 'B006', // 首頁 - 更多
  C00100: 'C001', // 更多_帳戶服務 - 帳戶總覽頁
  C00200: 'C002', // 更多_帳戶服務 - 社群帳本
  C00300: 'C003', // 更多_帳戶服務 - 臺幣活存 (存款卡(台)首頁)
  C00400: 'C004', // 更多_帳戶服務 - 外幣活存 (存款卡(外)首頁)
  C00500: 'C005', // 更多_帳戶服務 - 證券交割戶 (證券交割戶首頁)
  C00600: 'C006', // 更多_帳戶服務 - 存錢計畫
  C00700: 'C007', // 首頁 - 信用卡首頁 (含社群圈分潤)
  C00800: 'C008', // 更多_帳戶服務 - 匯出存摺
  C00900: 'C009', // 更多_帳戶服務 - 臺幣定存
  C01000: 'C010', // 更多_帳戶服務 - 外幣定存
  D00100_臺幣轉帳: 'D001', // 更多_轉帳提款 - 臺幣轉帳
  D00200: 'D002', // 更多_轉帳提款 - QR CODE轉帳
  D00300_無卡提款: 'D003', // 更多_轉帳提款 - 無卡提款
  D00400: 'D004', // 更多_轉帳提款 - 變更無卡提款密碼
  D00500: 'D005', // 更多_轉帳提款 - 常用帳號管理
  D00600: 'D006', // 更多_轉帳提款 - 約定帳號管理
  D00700: 'D007', // 更多_轉帳提款 - 外幣轉帳_本行同幣別外幣轉帳流程
  D00800: 'D008', // 更多_轉帳提款 - 預約轉帳查詢/取消
  D00900: 'D009', // 更多_轉帳提款 - 境外快速匯款 Phase II
  E00100_換匯: 'E001', // 更多_投資理財 - 換匯
  E00200: 'E002', // 更多_投資理財 - 匯率 (含在換匯裡的功能，另外拉出一個獨立入口)
  E00300: 'E003', // 更多_投資理財 - 金融百貨
  F00100: 'F00100', // 更多_申請 - 申請臺幣數存
  F00200: 'F00200', // 更多_申請 - 申請證券交割戶
  F00300: 'F00300', // 更多_申請 - 申請外幣數存
  F00400: 'F00400', // 更多_申請 - 申請貸款
  F00500: 'F00500', // 更多_申請 - 申請信用卡
  L00100: 'L001', // 更多_貸款 - 我的貸款 (原名：繳款紀錄)
  L00200: 'L002', // 更多_貸款 - 應繳查詢 (原名：應繳本息明細)
  L00300: 'L003', // (入口：我的貸款) - 繳款紀錄
  M00100: 'M001', // 更多_社群圈 - 社群圈 (社群圈首頁) 含 推薦碼分享
  M00200: 'M002', // 更多_社群圈 - 好友查詢
  M00300: 'M003', // ? TODO: 確認功能中文名稱
  N00200: 'N002', // ? TODO: 確認功能中文名稱
  R00100: 'R001', // 更多_信用卡 - 即時消費明細
  R00200: 'R002', // (入口：信用卡首頁) - 晚點付 (原名：分期)
  R00300: 'R003', // 更多_信用卡 - 帳單明細
  R00400: 'R004', // 更多_信用卡 - 繳費
  R00500: 'R005', // 更多_信用卡 - 自動扣繳申請/查詢
  R00600: 'R006', // 更多_信用卡 - 額度臨調 Phase II
  S00100_我的最愛: 'S001', // 更多_金融助手 - 我的最愛設定
  S00101_我的最愛v2: 'S00101', // 更多_金融助手 - 我的最愛設定
  S00200: 'S002', // 更多_金融助手 - 約定本人帳號設定
  S00300: 'S003', // 更多_金融助手 - 視訊約定帳號設定
  S00400: 'S004', // 更多_金融助手 - 訊息通知設定
  S00500: 'S005', // 更多_金融助手 - 他行存款自動存入設定
  S00600: 'S006', // 更多_金融助手 - 常見問題
  S00700: 'S007', // 更多_金融助手 - 金融卡啟用
  S00800: 'S008', // 更多_金融助手 - 金融卡掛失補發
  S00900: 'S009', // 更多_金融助手 - 數存會員升級(超商驗證)
  T00100: 'T001', // 更多_金融助手 - 個人化設定
  T00200: 'T002', // 更多_金融助手_個人化設定 - 快速登入設定
  T00300: 'T003', // 更多_金融助手_個人化設定 - 非約定轉帳設定
  T00400: 'T004', // 更多_金融助手_個人化設定 - 無卡提款設定
  T00500: 'T005', // 更多_金融助手_個人化設定 - 行動金融憑證設定
  T00600: 'T006', // 更多_金融助手 - 手機號碼收款設定
  T00700: 'T007', // 更多_金融助手_個人化設定 - 基本資料變更
  T00800: 'T008', // 更多_金融助手_個人化設定 - 使用者代號變更
  T00900: 'T009', // 更多_金融助手_個人化設定 - 網銀密碼變更
  Z99997: 'Z99997', // 更多_金融助手_個人化設定 - 搖一搖功能設定
};
