const T00200AccordionContent = () => (
  <>
    <h1>【快速登入設定】</h1>
    <ol>
      <li>當您於Bankee APP啟用快速登入服務（下稱本服務），即代表您已知悉並同意以設定之圖形密碼（6至12個連續可重複之點位）或行動裝置內建指紋/臉部辨識功能，取代「身分證字號/手機號碼、使用者代號及密碼」進行身分驗證，登入後即可查詢帳戶相關資料或執行特定交易。</li>
      <li>本服務僅限支援圖形密碼/指紋辨識/臉部辨識之行動裝置使用。</li>
      <li>請以未破解系統權限之行動裝置使用本服務，並妥善保管圖形密碼或行動裝置已設定個人指紋/臉部特徵，以確保帳戶及交易安全。</li>
    </ol>
    <h1>【APP裝置認證設定】</h1>
    <ol>
      <li>遠東商銀行動銀行APP裝置認證服務（下稱本認證服務）僅供本行存款戶個人使用，每一存款戶限認證（或稱綁定）一個行動裝置。</li>
      <li>申請本認證服務前，請確認申請認證之行動裝置使用SIM卡門號為留存於本行手機號碼，並能使用電信業者之行動網路（4G/5G）連線功能，且己關閉行動裝置WiFi、VPN或防火牆等軟體；行動裝置為雙卡機者，請以留存本行手機號碼之SIM卡進行認證。</li>
      <li>若欲變更行動裝置，請重新於新裝置進行本認證服務，重新認證成功後將自動解除原裝置之認證。認證完成後若移除APP，請重新安裝APP後再次申請本認證服務，始能使用相關功能。</li>
      <li>建議使用本認證服務前，先設定行動装置之「螢幕鎖定密碼」或「開機密碼」並妥善保管行動裝置，切勿使用己破解系統權限之行動裝置或將完成認證行動裝置交付他人使用，確保存款帳戶及交易安全。</li>
    </ol>
  </>

);

export default T00200AccordionContent;
