const S00400AccordionContent = (className) => (
  <>
    <ol className={className}>
      <li>
        本服務提供您設定各類訊息通知，讓您隨時接收個人帳務及專屬優惠訊息。
      </li>
      <li>
        除您已設定之通知項目外，本行亦會將全行公告/優惠訊息透過訊息通知服務發送給您，以確保您的權益。
      </li>
      <li>
        使用本服務前請先確認您的手機，「Bankee」APP的通知狀態已設定為開啟。
      </li>
      <li>
        「訊息通知」服務受網路傳輸影響，無法保證一定送達。
      </li>
      <li>
        本功能只提供本人之一台手機中設定，如於本人其他手機中設定，則原手機設定將自動解除。
      </li>
      <li>
        手機重置或重新安裝APP時，需要重新設定本功能。
      </li>
      <li>
        如您欲變更或取消「訊息通知」服務時，請至「更多
        {'>'}
        金融助手
        {'>'}
        訊息通知設定」功能中進行設定。
      </li>
    </ol>
  </>
);

export default S00400AccordionContent;
