export const PAYMENT_OPTION = {
  INTERNAL: 'self',
  EXTERNAL: 'external',
  CSTORE: 'shop',
};

export const AMOUNT_OPTION = {
  CUSTOM: 'custom',
  MIN: 'min',
  ALL: 'all',
};

export const paymentMethodOptions = [
  { label: '本行帳戶', value: PAYMENT_OPTION.INTERNAL },
  { label: '他行帳戶', value: PAYMENT_OPTION.EXTERNAL },
  { label: '超商條碼', value: PAYMENT_OPTION.CSTORE },
];

export const defaultValues = {
  paymentMethod: PAYMENT_OPTION.INTERNAL,
  amountOptions: '',
  customAmount: null,
  accountNo: '',
  bankId: '',
  extAccountNo: '',
};

export const CStoreContent = () => (
  <ol>
    <li>便利超商單筆繳款金額不得高於新臺幣2萬元整。</li>
    <li>繳款完成後約3個銀行營業日入帳，請您務必保留超商所提供之繳費收據至確認繳款正確入帳。</li>
    <li>上述應繳金額未含超商APP代收手續費(15元)，各超商手續費收取依超商現場條碼讀取金額為準。</li>
  </ol>
);

export const ExternalContent = () => (
  <ol>
    <li>待提供</li>
    <li>待提供</li>
    <li>待提供</li>
  </ol>
);

export const CreditCardTerm = () => (
  <>
    <h1>1.同意存錢計畫服務條款</h1>
    <h2>計畫內容</h2>
    <p>對方收款帳號若為他行帳戶，您將自行負擔新臺幣15元之跨行轉帳手續費。</p>
    <p>
      如有設定收款密碼，收款人收款時將會需要一組您設定的收款密碼，建議以其他管道提供收款密碼給收款人。
    </p>
    <p>
      社群轉帳連結款項將於收款人收款時自您的帳戶中扣除，請確認您的帳戶可用餘額充足。
    </p>
    <p>
      社群轉帳連結被領取金額將占用您非約定轉帳限額(臨櫃開立帳戶、一類及二類數位存款帳戶：每帳戶單筆5萬、當日10萬、當月累積不超過20萬。三類數位存款帳戶：每帳戶單筆1萬、當日3萬、當月累積不超過5萬。)，如您非約定轉帳限額已達上限，收款人將有無法收款的情況發生。
    </p>
    <h2>申請資格</h2>
    <p>對方收款帳號若為他行帳戶，您將自行負擔新臺幣15元之跨行轉帳手續費。</p>
    <p>
      如有設定收款密碼，收款人收款時將會需要一組您設定的收款密碼，建議以其他管道提供收款密碼給收款人。
    </p>
    <p>
      社群轉帳連結款項將於收款人收款時自您的帳戶中扣除，請確認您的帳戶可用餘額充足。
    </p>
    <h2>計息方式</h2>
    <p>
      社群轉帳連結被領取金額將占用您非約定轉帳限額(臨櫃開立帳戶、一類及二類數位存款帳戶：每帳戶單筆5萬、當日10萬、當月累積不超過20萬。三類數位存款帳戶：每帳戶單筆1萬、當日3萬、當月累積不超過5萬。)，如您非約定轉帳限額已達上限，收款人將有無法收款的情況發生。
    </p>
    <p>
      社群轉帳連結款項將於收款人收款時自您的帳戶中扣除，請確認您的帳戶可用餘額充足。
    </p>
    <h1>2.存錢計畫特別約定事項</h1>
    <p>
      社群轉帳連結被領取金額將占用您非約定轉帳限額(臨櫃開立帳戶、一類及二類數位存款帳戶：每帳戶單筆5萬、當日10萬、當月累積不超過20萬。三類數位存款帳戶：每帳戶單筆1萬、當日3萬、當月累積不超過5萬。)，如您非約定轉帳限額已達上限，收款人將有無法收款的情況發生。社群轉帳連結被領取金額將占用您非約定轉帳限額(臨櫃開立帳戶、一類及二類數位存款帳戶：每帳戶單筆5萬、當日10萬、當月累積不超過20萬。三類數位存款帳戶：每帳戶單筆1萬、當日3萬、當月累積不超過5萬。)，如您非約定轉帳限額已達上限，收款人將有無法收款的情況發生。社群轉帳連結被領取金額將占用您非約定轉帳限額(臨櫃開立帳戶、一類及二類數位存款帳戶：每帳戶單筆5萬、當日10萬、當月累積不超過20萬。三類數位存款帳戶：每帳戶單筆1萬、當日3萬、當月累積不超過5萬。)，如您非約定轉帳限額已達上限，收款人將有無法收款的情況發生。社群轉帳連結被領取金額將占用您非約定轉帳限額(臨櫃開立帳戶、一類及二類數位存款帳戶：每帳戶單筆5萬、當日10萬、當月累積不超過20萬。三類數位存款帳戶：每帳戶單筆1萬、當日3萬、當月累積不超過5萬。)，如您非約定轉帳限額已達上限，收款人將有無法收款的情況發生。
    </p>
  </>
);
